; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite4 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite5 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	satellite6 - satellite
	instrument18 - instrument
	instrument19 - instrument
	instrument20 - instrument
	satellite7 - satellite
	instrument21 - instrument
	instrument22 - instrument
	image2 - mode
	image0 - mode
	image1 - mode
	Star3 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star1 - direction
	Star0 - direction
	GroundStation7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star0)
	(supports instrument2 image0)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 image0)
	(supports instrument4 image2)
	(supports instrument4 image1)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star3)
	(supports instrument5 image1)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument6 image1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 image1)
	(supports instrument7 image2)
	(supports instrument7 image0)
	(calibration_target instrument7 Star0)
	(supports instrument8 image0)
	(supports instrument8 image1)
	(calibration_target instrument8 Star3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument9 image1)
	(supports instrument9 image2)
	(calibration_target instrument9 GroundStation2)
	(calibration_target instrument9 Star0)
	(supports instrument10 image2)
	(calibration_target instrument10 GroundStation5)
	(calibration_target instrument10 Star1)
	(supports instrument11 image1)
	(supports instrument11 image2)
	(supports instrument11 image0)
	(calibration_target instrument11 GroundStation7)
	(calibration_target instrument11 Star0)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument12 image0)
	(supports instrument12 image2)
	(supports instrument12 image1)
	(calibration_target instrument12 Star6)
	(calibration_target instrument12 GroundStation5)
	(supports instrument13 image2)
	(calibration_target instrument13 Star0)
	(supports instrument14 image0)
	(calibration_target instrument14 Star6)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(on_board instrument14 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star8)
	(supports instrument15 image1)
	(calibration_target instrument15 GroundStation7)
	(supports instrument16 image0)
	(supports instrument16 image2)
	(calibration_target instrument16 GroundStation2)
	(supports instrument17 image0)
	(supports instrument17 image2)
	(supports instrument17 image1)
	(calibration_target instrument17 GroundStation2)
	(calibration_target instrument17 Star0)
	(on_board instrument15 satellite5)
	(on_board instrument16 satellite5)
	(on_board instrument17 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star8)
	(supports instrument18 image2)
	(calibration_target instrument18 GroundStation4)
	(calibration_target instrument18 GroundStation7)
	(supports instrument19 image1)
	(calibration_target instrument19 GroundStation7)
	(calibration_target instrument19 Star0)
	(supports instrument20 image0)
	(calibration_target instrument20 Star0)
	(calibration_target instrument20 Star1)
	(on_board instrument18 satellite6)
	(on_board instrument19 satellite6)
	(on_board instrument20 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation5)
	(supports instrument21 image1)
	(supports instrument21 image2)
	(calibration_target instrument21 Star0)
	(supports instrument22 image2)
	(supports instrument22 image1)
	(calibration_target instrument22 GroundStation7)
	(calibration_target instrument22 Star0)
	(on_board instrument21 satellite7)
	(on_board instrument22 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Phenomenon12)
)
(:goal (and
	(pointing satellite6 Phenomenon12)
	(pointing satellite7 Star13)
	(have_image Star8 image0)
	(have_image Planet9 image1)
	(have_image Star10 image0)
	(have_image Phenomenon11 image2)
	(have_image Phenomenon12 image2)
	(have_image Star13 image0)
))

)

; plan
1. (turn_to satellite6 phenomenon12 groundstation5)
   deleted: (pointing satellite6 groundstation5)
   added: (pointing satellite6 phenomenon12)
   goals met: 1 of 8
2. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 1 of 8
3. (calibrate satellite2 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 1 of 8
4. (turn_to satellite2 star10 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star10)
   goals met: 1 of 8
5. (take_image satellite2 star10 instrument7 image0)
   added: (have_image star10 image0)
   goals met: 2 of 8
6. (turn_to satellite2 planet9 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 planet9)
   goals met: 2 of 8
7. (take_image satellite2 planet9 instrument7 image1)
   added: (have_image planet9 image1)
   goals met: 3 of 8
8. (turn_to satellite2 phenomenon12 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon12)
   goals met: 3 of 8
9. (take_image satellite2 phenomenon12 instrument7 image2)
   added: (have_image phenomenon12 image2)
   goals met: 4 of 8
10. (turn_to satellite2 phenomenon11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon11)
   goals met: 4 of 8
11. (take_image satellite2 phenomenon11 instrument7 image2)
   added: (have_image phenomenon11 image2)
   goals met: 5 of 8
12. (turn_to satellite2 star13 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star13)
   goals met: 5 of 8
13. (take_image satellite2 star13 instrument7 image0)
   added: (have_image star13 image0)
   goals met: 6 of 8
14. (turn_to satellite2 star8 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star8)
   goals met: 6 of 8
15. (take_image satellite2 star8 instrument7 image0)
   added: (have_image star8 image0)
   goals met: 7 of 8
16. (turn_to satellite7 star13 phenomenon12)
   deleted: (pointing satellite7 phenomenon12)
   added: (pointing satellite7 star13)
   goals met: 8 of 8
